In [1]:
import pandas as pd
from word2number import w2n

In [2]:
data=pd.read_csv('hiring.csv')
data

  experience  test_score  interview_score  salary($)
0        NaN         8.0                9      50000
1        NaN         8.0                6      45000
2       five         6.0                7      60000
3        two        10.0               10      65000
4      seven         9.0                6      70000
5      three         7.0               10      62000
6        ten         NaN                7      72000
7     eleven         7.0                8      80000

In [3]:
med_score=data.test_score.median()
med_score

8.0

In [4]:
data.test_score=data.test_score.fillna(med_score)
data

  experience  test_score  interview_score  salary($)
0        NaN         8.0                9      50000
1        NaN         8.0                6      45000
2       five         6.0                7      60000
3        two        10.0               10      65000
4      seven         9.0                6      70000
5      three         7.0               10      62000
6        ten         8.0                7      72000
7     eleven         7.0                8      80000

In [5]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   experience       6 non-null      object
 1   test_score       8 non-null      float64
 2   interview_score  8 non-null      int64
 3   salary($)        8 non-null      int64
dtypes: float64(1), int64(2), object(1)
memory usage: 388.0+ bytes

In [6]:
null_values=data.experience.isnull().sum()

In [7]:
data.experience=data.experience.fillna('zero')
data

  experience  test_score  interview_score  salary($)
0       zero         8.0                9      50000
1       zero         8.0                6      45000
2       five         6.0                7      60000
3        two        10.0               10      65000
4      seven         9.0                6      70000
5      three         7.0               10      62000
6        ten         8.0                7      72000
7     eleven         7.0                8      80000

In [8]:
for i in range(0,len(data.experience)):
 data.loc[i,'experience']=w2n.word_to_num(data.experience[i])
data

  experience  test_score  interview_score  salary($)
0          0         8.0                9      50000
1          0         8.0                6      45000
2          5         6.0                7      60000
3          2        10.0               10      65000
4          7         9.0                6      70000
5          3         7.0               10      62000
6         10         8.0                7      72000
7         11         7.0                8      80000

In [9]:
total=data.experience.count()
import math
med=math.floor(data.experience.sum()/(total-null_values))
med

6

In [10]:
data.loc[0,'experience']=data.loc[0,'experience']=med

In [11]:
data

  experience  test_score  interview_score  salary($)
0          6         8.0                9      50000
1          0         8.0                6      45000
2          5         6.0                7      60000
3          2        10.0               10      65000
4          7         9.0                6      70000
5          3         7.0               10      62000
6         10         8.0                7      72000
7         11         7.0                8      80000

In [12]:
from sklearn import linear_model
model=linear_model.LinearRegression()
model

LinearRegression()

In [13]:
train_x=data.loc[:,'experience':'interview_score']
train_y=data.loc[:,'salary($)']

In [14]:
train_x

  experience  test_score  interview_score
0          6         8.0                9
1          0         8.0                6
2          5         6.0                7
3          2        10.0               10
4          7         9.0                6
5          3         7.0               10
6         10         8.0                7
7         11         7.0                8

In [15]:
train_y

0    50000
1    45000
2    60000
3    65000
4    70000
5    62000
6    72000
7    80000
Name: salary($), dtype: int64

In [16]:
model.fit(train_x,train_y)

LinearRegression()

In [17]:
model.predict([[6,8,9]])

/Users/saurabhparab/anaconda3/lib/python3.11/site-packages/sklearn/base.py:439: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([65681.34023854])

In [18]:
data

  experience  test_score  interview_score  salary($)
0          6         8.0                9      50000
1          0         8.0                6      45000
2          5         6.0                7      60000
3          2        10.0               10      65000
4          7         9.0                6      70000
5          3         7.0               10      62000
6         10         8.0                7      72000
7         11         7.0                8      80000

In [19]:
model.predict([[6,8,9]])

/Users/saurabhparab/anaconda3/lib/python3.11/site-packages/sklearn/base.py:439: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([65681.34023854])

In [20]:
model.coef_

array([2493.95794099, 1623.19522913, 1094.63276836])

In [21]:
model.intercept_

27880.335844318906

In [22]:
data.experience.isnull().sum()

0

In [23]:
d=pd.read_csv("api.csv")

In [24]:
d

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9,...,Unnamed: 24,Unnamed: 25,Unnamed: 26,Unnamed: 27,Unnamed: 28,Unnamed: 29,Unnamed: 30,Unnamed: 31,Unnamed: 32,Unnamed: 33
0,NaN,Time,Top Insurance Companies.0.No,Top Insurance Companies.0.Name,Top Insurance Companies.0.Market Capitalization,Top Insurance Companies.1.No,Top Insurance Companies.1.Name,Top Insurance Companies.1.Market Capitalization,Top Insurance Companies.2.No,Top Insurance Companies.2.Name,...,Top Insurance Companies.7.Name,Top Insurance Companies.7.Market Capitalization,Top Insurance Companies.8.No,Top Insurance Companies.8.Name,Top Insurance Companies.8.Market Capitalization,Top Insurance Companies.9.No,Top Insurance Companies.9.Name,Top Insurance Companies.9.Market Capitalization,source,url
1,NaN,Feb 2019,1,Berkshire Hathaway ( BRK.A),$308 billion,2,China Life Insurance (LFC),$80 billion,3,Allianz (AZSEY),...,AIA Group Hong Kong (AAIGF),$54.4 billion,9,ING Groep (ING),$54.4 billion,10,Zurich Insurance (ZURVY),$45.4 billion,investopedia.com,https://www.investopedia.com/articles/active-t...